{
  "navbar": {
    "contact": {
      "title": "Kontakt",
      "description": "Send meg en melding!",
      "form": {
        "input1": {
          "label": "Navn",
          "placeholder": "Patrick"
        },
        "input2": {
          "label": "Email",
          "placeholder": "pat@example.com"
        },
        "input3": {
          "label": "Melding",
          "placeholder": "Hvordan går det?"
        }
      },
      "button1": "Avbryt",
      "button2": "Send",
      "toast": "Meldingen er sendt!"
    }
  },
  "home": {
    "greeting": "Hei, Patrick her!",
    "location": "Kløfta, Norge",
    "about": "Jeg har nettopp fullført mitt tredje og siste år av en bachelor i design ved UiO, og har en stor interesse for front-end utvikling og alt det spennende som følger med!",

    "tabs": {
      "projects": {
        "label": "Prosjekter",
        "1": {
          "date": "Feb 2024 - Juni 2024",
          "title": "Software Engineering med prosjektarbeid",
          "description": "Apputvikling med Teamarbeid",
          "list": {
            "item1": "Ledet et team på seks personer ved bruk av Scrum-metodikk",
            "item2": "Designet komponenter, flowcharts, og sekvensdiagrammer",
            "item3": "Gjennomførte workshops og brukerundersøkelser"
          }
        },
        "2": {
          "date": "Feb 2023 - Juni 2023",
          "title": "Bruksorientert design",
          "description": "Utvikling av digital prototype i samarbeid med en spesifikk brukergruppe",
          "list": {
            "item1": "Ansvarlig for utvikling og vedlikehold av prosjektets hjemmeside",
            "item2": "Presenterte prototyper for brukere og innhentet verdifull innsikt for å forbedre produktutviklingen"
          }
        },
        "3": {
          "date": "Juni 2024",
          "title": "Image Generator",
          "description": "Utvikler",
          "list": {
            "item1": "Utviklet en responsiv nettside som tilpasser seg forskjellige skjermstørrelser",
            "item2": "Brukte Unsplash API til å hente bilder for visuelle elementer i prosjektet"
          }
        }
      },

      "education": {
        "label": "Utdanning",
        "1": {
          "date": "Aug 2022 - Juni 2025",
          "title": "Bachelor i Design, bruk, interaksjon",
          "description": "Institutt for informatikk ved Universitetet i Oslo",
          "list": {
            "item1": "Bruksorientert design",
            "item2": "Software Engineering",
            "item3": "Informasjonssikkerhet"
          },
          "project-link": "1. Års Prosjekt"
        },
        "2": {
          "date": "Aug 2019 - Juni 2022",
          "title": "Studiespesialisering",
          "description": "Hoppensprett Akademiet VGS",
          "list": {
            "item1": "Informasjonsteknologi",
            "item2": "2. plass i Horisont hos Norges Bank"
          }
        }
      }
    }
  },

  "recent-projects": {
    "title": "Tidligere prosjekter",
    "back": "Gå tilbake",

    "image-generator": {
      "title": "Image Generator",
      "date": "Juni 2024",
      "description": "Søk etter bilder ved hjelp av nøkkelord, og få vist et galleri med treff hentet fra Unsplash sitt API.",
      "text": {
        "section1": {
          "text1": "Dette var mitt aller første prosjekt i React! I tillegg til å lære React og Typescript fra bunnen av, tok jeg også i bruk både Tailwind og shadcn/ui for første gang.",
          "text2": "Jeg integrerte også mitt første API, så det ble mye nytt på en gang. Heldigvis hadde jeg allerede en del erfaring fra tidligere småprosjekter hvor jeg brukte vanlig HTML, CSS, og JavaScript, så overgangen føltes ikke så overveldende som den kanskje kunne gjort. Selv om det var en litt bratt læringskurve, var det veldig gøy å se hvordan ting begynte å henge sammen, alt fra komponentstruktur og styling ved datahenting og dynamisk innhold.",
          "text3": "Prosjektet ble en fin introduksjon til nye moderne verktøy, og hvordan utvikling kan være både mer effektiv og mer morsom. Og så klart ga det meg masse motivasjon til å utforske videre!"
        },
        "section2": {
          "title": "Så hvordan funker det?",
          "text1": "Det er ikke noe fancy greier her, men det funker og det ser bra ut. Jeg koblet til Unsplash sitt API (ja, det er stock photos), og bruker det til å hente inn så mange bilder jeg ønsker samtidig. Det første bildet virker som et Hero image, mens resten ruller nedover i ett galleri som aldri tar slutt. Det er et enkelt konsept, men det ser ganske kult ut."
        },
        "section3": {
          "title": "Veien videre",
          "text1": "Hele prosjektet ble unnagjort på cirka en uke, så det ble mest fokus på å få grunnlaget på plass. I etterkant har jeg grubla over hvordan jeg kunne bygget videre på det, kanskje ved å involvere mer interaktivitet, avansert logikk, eller utforsket nye konseper jeg har lært siden. Men som oftest, har andre prosjekter og forpliktelser kommet i veien.",
          "text2": "Likevel ser jeg verdien i det jeg erfarte. Koden kan nok føles litt utdatert, både visuelt og teknisk, da jeg ville gjort mye annerledes nå. Jeg ser potensiale i å plukke det opp igjen med friske øyne og nye ferdigheter, skulle motivasjonen være der. Det viktigste er det solide grunnlaget som prosjektet ga meg slik at jeg kan bygge videre på det, særlig da det ble veien min inn til moderne og effektiv webutvikling."
        }
      },
      "links": "Kode"
    },

    "dashboard": {
      "title": "Dashboard",
      "date": "Februar 2025 - Mai 2025",
      "description": "Samling av praktiske funksjoner på ett sted, med fleksibel layout og lokal lagring.",
      "text": {
        "section1": {
          "text1": "Dashboard er et prosjekt jeg har drevet på med litt av og på de siste månedene, og fungerer som et personlig kontrollpanel som samler nyttige funksjoner på ett sted. Tanken var å utvikle ett verktøy som var nyttig i hverdagen min, istedenfor et teknisk prosjekt jeg ikke ville bruke. Foreløpig har jeg implementert en rekke funksjoner, blant annet en chat-funksjon integrert med Gemini, et system for bokmerker, og en enkel notisblokk."
        },
        "section2": {
          "title": "Det tekniske",
          "text1": "Så mye av det tekniske var jeg allerede kjent med. Jeg brukte Tailwind og shadcn/ui som jeg allerede har brukt i tidligere prosjekter og derfor forblir det samme. Som nevnt over, integrerte jeg Gemini. Det var en ganske straightforward prosess, ettersom API-et fungerer ganske likt mange andre. Jeg valgte Gemini fremfor ChatGPT, hovedsakelig fordi det er gratis ,og kan i mange tilfeller være et bedre alternativ.",
          "text2": "En annen viktig (men lite synlig) del av prosjektet er den fleksible layouten. Her har jeg brukt dnd-kit, et bibliotek for drag-&-drop-funksjonalitet, som lar brukeren flytte og tilpasse kortene på siden slik de selv vil, både i størrelse og plassering.",
          "text3": "Når det gjelder datalagring, har jeg foreløpig valgt å bruke localStorage. Det er enkelt og fungerer greit nok slik at brukerens data blir lagret mellom økter. En database ville selvsagt gitt mer robust lagring, men for dette stadiet i prosjektet holder det i massevis. Dette er uansett noe jeg kan bygge videre på senere, hvis det er behov."
        },
        "section3": {
          "text1": "Jeg har satt utviklingen på pause foreløpig grunnet andre forpliktelser, men planen er absolutt å fortsette å jobbe med Dashboard jevnlig. Det finnes uendelige muligheter for utvikling, både små forbedringer og større utvidelser.",
          "text2": "Kanskje jeg publiserer den etter hvert, vi får se :)"
        }
      },
      "links": "Kode"
    },

    "watchd": {
      "title": "Watchd",
      "date": "Juni 2025 - Nå",
      "description": "Sjekk ut de mest populære filmer og serier eller vis fram dine favoritter på profilen din!",
      "text": {
        "section1": {
          "text1": "Denne gangen har jeg tatt i bruk flere nye ting. Utgangspunktet var å bygge noe med Sanity CMS, men etter hvert som behovene økte, utvidet stacken seg også. Da implementerte jeg Prisma for første gang og koblet det opp til PostgreSQL for modellering av brukere og håndtering av data på en robust og fleksibel måte."
        },
        "section2": {
          "title": "Hva er watchd?",
          "text1": "Watchd er min personlige vri på IMDB og Letterboxd, et plattform hvor man kan søke etter filmer, serier, eller skuespillere. I tillegg har jeg bygget et brukersystem med støtte for registrering via brukernavn og passord, som gir deg tilgang til din egen personlig profil. Med en egen bruker, kan du legge til filmer og serier til din liste og vise fram favorittene dine hvis det er noe du likte ekstra godt :)",
          "text2": "Videre, finnes det trending sider for både filmer og serier som er populært for tiden."
        },
        "section3": {
          "title": "Stacken",
          "text1": "Først og fremst brukte jeg Tailwind og shadcn/ui for mye av det visuelle. Det er lett, fleksibelt, og ryddig, så det var en no-brainer. Litt mer komplisert ble det da jeg begynte å integrere flere API-endepunkter sammen, samtidig som jeg ville inkludere Sanity schemas. All data hentes fra The Movie Database (TMDB). Jeg vurderte også IMDB og Letterboxd, men de har ikke åpen støtte for slik integrasjon."
        },
        "section4": {
          "title": "Fremtidig planer",
          "text1": "Jeg fortsetter med dette prosjektet fremdeles og vil gjøre det til jeg føler meg ferdig. TMDB tibyr utrolig mange forskjellige endepunkter så det vil alltid være noe kult å legge til. Jeg vil også prøve å oppdatere denne siden når det passer, forhåpentligvis om ikke så lenge."
        }
      },
      "links": "Kode"
    }
  },
  "footer": {
    "author": "Laget av Patrick"
  }
}
